УТ_для_edt/src/InformationRegisters/СмартЗначенияСвойствФильтров/СмартЗначенияСвойствФильтров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СмартЗначенияСвойствФильтров</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.СмартФильтрыНоменклатуры</types>
    </type>
  </resources>
  <attributes>
    <name>ЗначениеСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСвойств</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СмартФильтрыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/СмартЗначенияСвойствФильтров/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ВидСвойствПриИзменении(Элемент)
	Множественное=ПолучитьМножественное(Запись.ВидСвойств);
	Если Множественное Тогда
		Доступности();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМножественное(ПроверяемыйВид)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СмартФильтрыНоменклатуры.Множественное КАК Множественное
		|ИЗ
		|	ПланВидовХарактеристик.СмартФильтрыНоменклатуры КАК СмартФильтрыНоменклатуры
		|ГДЕ
		|	СмартФильтрыНоменклатуры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПроверяемыйВид);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Множественное; 
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции // ПолучитьМножественное()()

&НаСервере
Процедура СЗЗначениеПриИзмененииНаСервере()
	СтрокаЗначения="";
	Для Каждого Стр из СЗ Цикл
		СтрокаЗначения=?(СтрокаЗначения<>"",СтрокаЗначения+";",СтрокаЗначения)+Стр.Значение;
	КонецЦикла;
	Запись.ЗначениеСтрока=СтрокаЗначения;
КонецПроцедуры

&НаКлиенте
Процедура СЗЗначениеПриИзменении(Элемент)
	СЗЗначениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Множественное=ПолучитьМножественное(Запись.ВидСвойств);
	Если Множественное Тогда
		Доступности();
	Иначе
		Элементы.МножественноеЗначение.Видимость=Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура Доступности()
	Элементы.Значение.Доступность=Ложь;
	Элементы.ЗначениеСтрока.Видимость=Истина;
	Элементы.СЗЗначение.ВыбиратьТип=Ложь;
	Элементы.СЗЗначение.ОграничениеТипа=Запись.ВидСвойств.ТипЗначения;	
	Если Запись.ВидСвойств.ТипЗначения=Новый ОписаниеТИпов("СправочникСсылка.СмартДопФильтрыНоменклатуры") Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Запись.ВидСвойств");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.СЗЗначение.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ЗначениеСтрока) Тогда
		МассивСтрок=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Запись.ЗначениеСтрока,";",Истина,Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("Ключ") тогда
		
		Запрос = Новый Запрос;
		Если  Параметры.Ключ.ВидСвойств.ТипЗначения=Новый ОписаниеТипов("СправочникСсылка.смартОборудованиеКлиентов") Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	смартОборудованиеКлиентов.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.смартОборудованиеКлиентов КАК смартОборудованиеКлиентов
			|ГДЕ
			|	смартОборудованиеКлиентов.Наименование В(&Наименование)";
			
			
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СмартДопФильтрыНоменклатуры.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СмартДопФильтрыНоменклатуры КАК СмартДопФильтрыНоменклатуры
			|ГДЕ
			|	СмартДопФильтрыНоменклатуры.Владелец = &Владелец
			|	И СмартДопФильтрыНоменклатуры.Наименование В(&Наименование)";
			
			Запрос.УстановитьПараметр("Владелец", Параметры.Ключ.ВидСвойств);

		КонецЕсли; 	
		
		Запрос.УстановитьПараметр("Наименование", МассивСтрок);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СЗ.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтрокаЗначения="";
	Для Каждого Стр из СЗ Цикл
		СтрокаЗначения=?(СтрокаЗначения<>"",СтрокаЗначения+";",СтрокаЗначения)+Стр.Значение;
	КонецЦикла;
	ТекущийОбъект.ЗначениеСтрока = СтрокаЗначения;
	
КонецПроцедуры
